{
  "backend/main.mo": "Defines homepage content types, user profiles, and admin‑protected update APIs using AccessControl with CRUD endpoints for menu, highlights, testimonials, and contact info.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature requirements to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend source files for reference in build planning.",
  "frontend/index.css": "Defines Tailwind base styles and custom CSS variables for light and dark themes with Royal Cafe color tokens.",
  "frontend/index.html": "HTML entry point loading the React app with SEO metadata for Royal Cafe.",
  "frontend/src/App.tsx": "Main React app managing public vs editor views, loading homepage content, and checking admin authorization with React Query.",
  "frontend/src/components/RoyalCafe/admin/AccessDenied.tsx": "Displays an access‑denied message with a button to return home for unauthorized users.",
  "frontend/src/components/RoyalCafe/admin/AdminLoginDialog.tsx": "Admin login modal validating a fixed code, updating auth state, and triggering success callbacks.",
  "frontend/src/components/RoyalCafe/admin/EditorPage.tsx": "Content editor UI for homepage text, highlights, testimonials, and menu data with save functionality.",
  "frontend/src/components/RoyalCafe/data/content.ts": "Static data definitions for highlights, menu categories, testimonials, and contact info.",
  "frontend/src/components/RoyalCafe/Footer.tsx": "Footer with quick links, Instagram link, and admin login flow that opens the editor after verifying admin status.",
  "frontend/src/components/RoyalCafe/NavBar.tsx": "Responsive navbar with scroll-aware styling, navigation links, mobile menu, and admin login/editor access handling.",
  "frontend/src/components/RoyalCafe/sections/AboutSection.tsx": "About section displaying cafe description and a grid of feature cards with icons.",
  "frontend/src/components/RoyalCafe/sections/ContactLocationSection.tsx": "Contact and location section showing address, hours, and map link with loading states.",
  "frontend/src/components/RoyalCafe/sections/GallerySection.tsx": "Empty placeholder file for a gallery section component.",
  "frontend/src/components/RoyalCafe/sections/HeroSection.tsx": "Renders the landing hero with background image, logo, tagline, location, and CTA buttons with smooth-scroll behavior.",
  "frontend/src/components/RoyalCafe/sections/HighlightsSection.tsx": "Displays parsed highlight items or loading skeletons in a grid with names, descriptions, prices, and optional badges.",
  "frontend/src/components/RoyalCafe/sections/MenuSection.tsx": "Shows menu categories and items or skeleton loaders, including names, descriptions, and prices.",
  "frontend/src/components/RoyalCafe/sections/ReviewsSection.tsx": "Parses and displays customer testimonials with star ratings or loading placeholders in a grid layout.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAdminAuth.ts": "Wraps the admin-check query and exposes admin status with loading and error state.",
  "frontend/src/hooks/useHomePageContent.ts": "Fetches homepage content with fallback defaults and provides a mutation for saving updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity state management via context using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines react-query hooks for fetching and updating homepage content and checking admin status using the actor.",
  "frontend/src/index.css": "Defines Tailwind layers, custom OKLCH color variables for light/dark themes, typography settings, and utility classes for Royal Cafe branding.",
  "frontend/src/main.tsx": "Bootstraps the React app using ReactDOM, wraps it with React Query and Internet Identity providers, and loads global styles.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL parameters with sessionStorage fallback and hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and Royal Cafe theme extensions.",
  "project_state.json": "Stores the project’s current specification, features, issues, and design requirements for the Royal Cafe website."
}