{
  "backend/main.mo": "Motoko canister implementing homepage content storage, user profiles, and admin‑protected updates using access control maps.",
  "feature_evidence.json": "Feature evidence report listing two feature changes with affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of all major frontend components, hooks, and configuration files.",
  "frontend/index.css": "Tailwind base and theme variables defining color palette and layout tokens for light and dark modes.",
  "frontend/index.html": "HTML entry point with SEO metadata and root element loading the React application.",
  "frontend/src/App.tsx": "Main React app that switches between public homepage and admin editor based on authorization state.",
  "frontend/src/components/RoyalCafe/admin/AccessDenied.tsx": "Shows an access-denied screen with a message and a button to exit when the user lacks admin permissions.",
  "frontend/src/components/RoyalCafe/admin/AdminLoginDialog.tsx": "Provides an admin login dialog that validates an admin code, updates session state, and triggers backend admin checks.",
  "frontend/src/components/RoyalCafe/admin/EditorPage.tsx": "Implements a full content editor interface for homepage data including testimonials and menus with save functionality.",
  "frontend/src/components/RoyalCafe/data/content.ts": "Contains static menu items, highlights, testimonials, and contact info used as default homepage content.",
  "frontend/src/components/RoyalCafe/Footer.tsx": "Footer with quick links, admin login handling, and branding info minus Instagram links.",
  "frontend/src/components/RoyalCafe/NavBar.tsx": "Responsive navbar with scroll navigation, admin login flow, and mobile menu behavior.",
  "frontend/src/components/RoyalCafe/sections/AboutSection.tsx": "Renders the About section with feature cards describing the cafe’s qualities.",
  "frontend/src/components/RoyalCafe/sections/ContactLocationSection.tsx": "Displays contact details, address, hours, and a map link using either fetched or default content.",
  "frontend/src/components/RoyalCafe/sections/GallerySection.tsx": "Empty placeholder file for a gallery section.",
  "frontend/src/components/RoyalCafe/sections/HeroSection.tsx": "Renders the hero banner with background image, logo, tagline, location, and navigation buttons.",
  "frontend/src/components/RoyalCafe/sections/HighlightsSection.tsx": "Renders a highlights grid by parsing highlight strings and showing skeletons while loading. Displays name, description, price, and optional badge for each item.",
  "frontend/src/components/RoyalCafe/sections/MenuSection.tsx": "Shows menu categories with item details and prices, falling back to skeletons during loading. Uses content-provided categories to render structured menu sections.",
  "frontend/src/components/RoyalCafe/sections/ReviewsSection.tsx": "Parses testimonial strings and displays a reviews grid with stars, quotes, and author info, with skeleton placeholders while loading.",
  "frontend/src/hooks/queryKeys.ts": "Defines shared React Query keys for actors, admin status, and homepage content.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on identity, reinitializing on identity change and invalidating dependent queries.",
  "frontend/src/hooks/useAdminAuth.ts": "Wraps admin-status query and returns admin flag, loading state, and errors.",
  "frontend/src/hooks/useHomePageContent.ts": "Fetches homepage content with fallback defaults and exposes a mutation helper to save updated content.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling auth client creation, login state, stored identity loading, and logout.",
  "frontend/src/hooks/useQueries.ts": "Implements React Query hooks for fetching and updating homepage content and checking admin status, initializing access control when needed.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom OKLCH color variables for light/dark modes, font settings, and utility classes for the Royal Cafe theme.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers before rendering App.",
  "frontend/src/utils/accessControlInit.ts": "Initializes backend actor access control using a stored admin token, memoizing per actor instance.",
  "frontend/src/utils/adminCode.ts": "Normalizes admin codes and exposes the canonical expected admin code for validation.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for extracting, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, container settings, and animations using the Royal Cafe design variables.",
  "project_state.json": "Project metadata describing design goals, requirements, known issues, and current feature implementations for the Royal Cafe website."
}