{
  "backend/main.mo": "Motoko canister managing homepage content, contact info, menu, testimonials, user profiles, and publish state with admin‑gated update operations.",
  "feature_evidence.json": "Feature evidence metadata listing feature descriptions, related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries mapping many frontend file paths to brief descriptions of their purpose and behavior.",
  "frontend/index.css": "Global Tailwind-based styles defining color variables, dark mode theming, and base element styling.",
  "frontend/index.html": "HTML entry point containing metadata and root mounting point for the React app.",
  "frontend/src/App.tsx": "Main app routing logic handling admin/editor mode, publish-state gating, and rendering homepage sections.",
  "frontend/src/components/RoyalCafe/admin/AccessDenied.tsx": "Shows an access denied message with a button to return to the homepage.",
  "frontend/src/components/RoyalCafe/admin/AdminLoginDialog.tsx": "A dialog for entering and validating an admin code, updating session state, and triggering admin access on success.",
  "frontend/src/components/RoyalCafe/admin/EditorPage.tsx": "Full content editor for homepage data with saving, publishing, and testimonial parsing features.",
  "frontend/src/components/RoyalCafe/data/content.ts": "Static content definitions for highlights, menu categories, testimonials, and contact info.",
  "frontend/src/components/RoyalCafe/Footer.tsx": "Footer displaying contact info with fallbacks and providing admin login and editor access controls.",
  "frontend/src/components/RoyalCafe/MaintenanceScreen.tsx": "Displays a maintenance notice with an option for admins to open a login dialog and enter the editor.",
  "frontend/src/components/RoyalCafe/NavBar.tsx": "Provides a responsive navigation bar with scroll-based styling, section navigation, and admin/editor access.",
  "frontend/src/components/RoyalCafe/sections/AboutSection.tsx": "Renders the About section with feature cards highlighting the cafe’s qualities.",
  "frontend/src/components/RoyalCafe/sections/ContactLocationSection.tsx": "Displays contact details, location, and business hours with loading skeletons and fallbacks from content.",
  "frontend/src/components/RoyalCafe/sections/GallerySection.tsx": "Empty file with no implemented component.",
  "frontend/src/components/RoyalCafe/sections/HeroSection.tsx": "Renders the hero banner with background image, title, tagline, buttons, and smooth scroll behavior.",
  "frontend/src/components/RoyalCafe/sections/HighlightsSection.tsx": "Parses and displays highlight items with name, description, price, and optional badges, including loading skeletons.",
  "frontend/src/components/RoyalCafe/sections/MenuSection.tsx": "Shows menu categories and items with prices and descriptions, supporting loading states.",
  "frontend/src/components/RoyalCafe/sections/ReviewsSection.tsx": "Parses and displays customer testimonials with star ratings and loading skeletons.",
  "frontend/src/hooks/queryKeys.ts": "Defines reusable React Query keys for actor, admin status, homepage content, and publish state.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on authentication, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useAdminAuth.ts": "Wraps admin‑status query and returns admin state with loading and error info.",
  "frontend/src/hooks/useHomePageContent.ts": "Fetches and updates homepage content with default fallbacks and exposes save helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, and identity loading. Wraps AuthClient creation and tracks login status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and updating homepage content, publish state, and admin status using the backend actor. Ensures access control initialization before admin operations.",
  "frontend/src/index.css": "Configures global Tailwind and custom OKLCH-based color variables for light and dark themes. Adds typography, utility classes, and UI styling such as scrollbars and fonts.",
  "frontend/src/main.tsx": "Bootstraps the React app by mounting App within QueryClientProvider and InternetIdentityProvider. Loads global CSS and initializes React Query.",
  "frontend/src/utils/accessControlInit.ts": "Initializes backend actor access control using a stored admin token, memoizing per actor instance to avoid redundant initialization. Uses session parameters for token retrieval.",
  "frontend/src/utils/adminCode.ts": "Provides a helper to normalize admin codes and exports a predefined normalized admin code for validation. Ensures case- and whitespace-insensitive comparison.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session parameters, supporting both query-string and hash-based routing. Enables persistence of values like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, fonts, radii, and animations using custom CSS variables. Enables plugins like typography, container queries, and animations.",
  "project_state.json": "Stores the project’s current requirements, design notes, known issues, and feature definitions for building the Royal Cafe website. Includes updated admin login code, contact details, and directives for layout, CTAs, and removed sections."
}