{
  "kind": "build_request",
  "title": "Fix admin login so correct code grants access to the admin editor",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-22",
      "text": "Fix the admin authentication flow so that entering the correct admin code \"275101MAU\" actually authorizes the current caller and allows access to the admin-only editor page (no AccessDenied screen after successful login).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "not entering admin page by entering coorect code"
        ]
      },
      "acceptanceCriteria": [
        "From the NavBar or Footer Admin entry, entering exactly \"275101MAU\" results in the EditorPage being shown (not AccessDenied).",
        "The authorization decision is not purely client-side; the backend must be able to confirm whether the current caller is an admin.",
        "After successful login, the frontend admin check state updates without requiring a hard reload (i.e., the UI transitions into editor mode immediately)."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Backend: expose an admin-status API used by the frontend and ensure it behaves consistently with content update authorization (i.e., the same rule that allows updateHomePageContent must also make isCallerAdmin return true).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "not entering admin page by entering coorect code"
        ]
      },
      "acceptanceCriteria": [
        "The backend provides a callable method that the frontend can use as `actor.isCallerAdmin()` (as used in frontend/src/hooks/useQueries.ts).",
        "When a caller is not authorized as admin, the method returns false (it must not trap).",
        "When a caller is authorized as admin, the method returns true.",
        "Admin-only update endpoints (e.g., updateHomePageContent) remain protected and only succeed for callers recognized as admin by the backend."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Frontend: update AdminLoginDialog to perform admin login against the backend (instead of only local string-checking) and to refresh the cached admin status query after a successful login so NavBar/App editor gating works reliably.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "not entering admin page by entering coorect code"
        ]
      },
      "acceptanceCriteria": [
        "AdminLoginDialog attempts backend verification when the user submits the code, and shows a clear English error message if verification fails.",
        "On successful verification, the `isAdmin` React Query state (query key ['isAdmin']) is refreshed/invalidated so `useAdminAuth()` returns true without a page reload.",
        "After successful login, closing/opening the dialog continues to work correctly (no immediate auto-close loops from the Dialog onOpenChange handler)."
      ]
    }
  ],
  "constraints": [
    "Respect the single-actor backend architecture: keep all Motoko logic in backend/main.mo.",
    "Do not modify any frontend files under frontend/src/components/ui or any other paths listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "Adding third-party authentication providers (only Internet Identity is supported).",
    "Changing the cafe website public content/sections beyond what is needed to fix admin login."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}