{
  "kind": "build_request",
  "title": "Update contact address format and remove Instagram option",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-38",
      "text": "Update the Contact & Location content so the displayed values are:\n- Contact number: \"+91 94508 14050\"\n- Location/address: \"Royal Cafe, Street 1, Varpur, Mau, Uttar Pradesh\"\nEnsure these values render in the existing ContactLocationSection without overwriting other copy, and ensure the phone number remains its own dedicated phone line.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "contact number - +91 94508 14050 / location - Royal Cafe, Street 1, Varpur, Mau, Uttar Pradesh"
        ]
      },
      "acceptanceCriteria": [
        "On the public site, the Contact card shows a line reading exactly: \"Phone: +91 94508 14050\".",
        "On the public site, the Location card shows the address text exactly: \"Royal Cafe, Street 1, Varpur, Mau, Uttar Pradesh\" (line breaks are allowed, but the text must match).",
        "No other paragraphs/copy in the Contact & Location section are removed or replaced as a side effect of the update.",
        "The Admin Editor \"Contact Info\" tab loads with the updated address/phone as the default/fallback when no saved content exists."
      ]
    },
    {
      "id": "REQ-39",
      "text": "Remove the Instagram option from the site so Instagram is no longer shown as an available social platform (including removing the Instagram icon/link in the footer and any other social/contact UI that exposes Instagram).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "and removed instagram id option"
        ]
      },
      "acceptanceCriteria": [
        "The footer no longer displays an Instagram icon/link, and the Instagram URL https://www.instagram.com/royal_cafe_mau/ is no longer rendered in the UI.",
        "There are no other Instagram social links/icons rendered anywhere on the public site."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under frontend/src/components/ui or any other paths listed in frontend.immutablePaths."
  ],
  "nonGoals": [
    "Do not change Google Maps embed/link behavior unless required to satisfy the new address text.",
    "Do not change admin authentication, admin code behavior, or editor access control as part of this request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}