{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin login flow to grant editor access after correct code",
  "requirements": [
    {
      "id": "REQ-22",
      "summary": "Ensure correct admin code results in backend-confirmed admin state and immediate access to the admin editor (no AccessDenied after successful login).",
      "acceptanceCriteria": [
        "From the NavBar or Footer Admin entry, entering exactly \"275101MAU\" results in the EditorPage being shown (not AccessDenied).",
        "The authorization decision is not purely client-side; the backend must be able to confirm whether the current caller is an admin.",
        "After successful login, the frontend admin check state updates without requiring a hard reload (i.e., the UI transitions into editor mode immediately)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RoyalCafe/admin/AdminLoginDialog.tsx",
          "operation": "modify",
          "description": "Replace local-only string check flow with a backend-confirmed login flow by persisting the admin secret token (\"caffeineAdminToken\") for the session and forcing React Query to refetch the actor/admin status, so App editor gating sees isAdmin=true immediately after a successful submit. Ensure the implementation relies on the existing authorization mechanism (selected component: authorization) via backend-confirmed admin status, not purely client-side checks. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useActor.ts",
          "operation": "modify",
          "description": "Ensure actor creation/refetch correctly reacts to admin-token changes during the session (e.g., after AdminLoginDialog stores the secret), so the actor is reinitialized and subsequent admin checks reflect the updated authorization without a full reload."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Adjust editor entry flow (if needed) to avoid switching into editor view until the refreshed admin status is available, preventing a transient AccessDenied after a successful login-triggered refetch."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Update AdminLoginDialog to verify admin login via backend state and refresh the cached admin-status query so NavBar/App gating updates immediately and dialog open/close behavior is stable.",
      "acceptanceCriteria": [
        "AdminLoginDialog attempts backend verification when the user submits the code, and shows a clear English error message if verification fails.",
        "On successful verification, the `isAdmin` React Query state (query key ['isAdmin']) is refreshed/invalidated so `useAdminAuth()` returns true without a page reload.",
        "After successful login, closing/opening the dialog continues to work correctly (no immediate auto-close loops from the Dialog onOpenChange handler)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RoyalCafe/admin/AdminLoginDialog.tsx",
          "operation": "modify",
          "description": "Fix Dialog onOpenChange handling so opening the dialog doesn't immediately trigger a close/reset. On submit: (1) validate the code format/value, (2) perform backend-based verification by triggering an actor re-init + isAdmin refetch (not just local string-checking), (3) show a clear error when backend-confirmed isAdmin remains false, and (4) on success, invalidate/refetch React Query cache for ['isAdmin'] (and any actor query keys) so useAdminAuth() updates immediately. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/RoyalCafe/NavBar.tsx",
          "operation": "modify",
          "description": "Ensure NavBar's Admin/Editor button behavior remains consistent with the refreshed ['isAdmin'] query state after login (no stale isAdmin causing the dialog to reopen or the editor to be denied)."
        },
        {
          "path": "frontend/src/components/RoyalCafe/Footer.tsx",
          "operation": "modify",
          "description": "Ensure Footer's Admin button behavior remains consistent with the refreshed ['isAdmin'] query state after login (no stale isAdmin causing the dialog to reopen or the editor to be denied)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "If necessary, refine the isAdmin query behavior to better support immediate post-login transitions (e.g., ensure it can be safely invalidated/refetched and does not incorrectly cache false across actor changes)."
        }
      ]
    }
  ]
}