{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update Contact & Location defaults and remove Instagram from UI",
  "requirements": [
    {
      "id": "REQ-38",
      "summary": "Update Contact & Location displayed phone/address defaults in ContactLocationSection while preserving existing copy and admin fallback behavior.",
      "acceptanceCriteria": [
        "On the public site, the Contact card shows a line reading exactly: \"Phone: +91 94508 14050\".",
        "On the public site, the Location card shows the address text exactly: \"Royal Cafe, Street 1, Varpur, Mau, Uttar Pradesh\" (line breaks are allowed, but the text must match).",
        "No other paragraphs/copy in the Contact & Location section are removed or replaced as a side effect of the update.",
        "The Admin Editor \"Contact Info\" tab loads with the updated address/phone as the default/fallback when no saved content exists."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RoyalCafe/data/content.ts",
          "operation": "modify",
          "description": "Update the default/fallback contact info so defaultContent.contactInfo.phone is \"+91 94508 14050\" and defaultContent.contactInfo.address is exactly \"Royal Cafe, Street 1, Varpur, Mau, Uttar Pradesh\" (no other default content should be changed)."
        },
        {
          "path": "frontend/src/components/RoyalCafe/sections/ContactLocationSection.tsx",
          "operation": "modify",
          "description": "Ensure the Location card renders the exact fallback address string from the updated default content (rather than reconstructing from parts), while keeping all other section copy unchanged and keeping the phone number on its own dedicated \"Phone:\" line."
        }
      ]
    },
    {
      "id": "REQ-39",
      "summary": "Remove Instagram as an available social option across the public UI (footer and any other exposed social/contact UI).",
      "acceptanceCriteria": [
        "The footer no longer displays an Instagram icon/link, and the Instagram URL https://www.instagram.com/royal_cafe_mau/ is no longer rendered in the UI.",
        "There are no other Instagram social links/icons rendered anywhere on the public site."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RoyalCafe/Footer.tsx",
          "operation": "modify",
          "description": "Remove the Instagram icon/link and any related imports/markup so the Instagram URL is not rendered in the footer."
        }
      ]
    }
  ]
}